### 04.04 복습(remind) & 추가

In [33]:
import pandas as pd
import numpy as np
selloutData = pd.read_csv('../dataset/kopo_channel_seasonality_new.csv')
selloutData.head()

  REGIONID    PRODUCT  YEARWEEK      QTY
0      A60   PRODUCT4    201402     71.0
1      A60  PRODUCT59    201402  22275.0
2      A60  PRODUCT34    201402   4463.0
3      A60  PRODUCT47    201402      0.0
4      A60  PRODUCT56    201402     23.0

In [34]:
selloutData["NEW_QTY"] = np.where(selloutData["QTY"]< 0,0,selloutData["QTY"])

### 53주차 제거

In [35]:
selloutData.dtypes

REGIONID     object
PRODUCT      object
YEARWEEK      int64
QTY         float64
NEW_QTY     float64
dtype: object

In [36]:
int(201623/100)

2016

In [37]:
201623%100

23

In [38]:
selloutData["WEEK"] = selloutData["YEARWEEK"]%100
# selloutData["TEST"] = (selloutData.YEARWEEK %100).astype(int)

In [39]:
selloutData["YEAR"] = round(selloutData["YEARWEEK"]/100,0)
selloutData.head()
# selloutData["TEST"] = (selloutData.YEARWEEK /100).astype(int)

  REGIONID    PRODUCT  YEARWEEK      QTY  NEW_QTY  WEEK    YEAR
0      A60   PRODUCT4    201402     71.0     71.0     2  2014.0
1      A60  PRODUCT59    201402  22275.0  22275.0     2  2014.0
2      A60  PRODUCT34    201402   4463.0   4463.0     2  2014.0
3      A60  PRODUCT47    201402      0.0      0.0     2  2014.0
4      A60  PRODUCT56    201402     23.0     23.0     2  2014.0

In [40]:
refineData = selloutData[selloutData.WEEK < 53]
refineData.head()

  REGIONID    PRODUCT  YEARWEEK      QTY  NEW_QTY  WEEK    YEAR
0      A60   PRODUCT4    201402     71.0     71.0     2  2014.0
1      A60  PRODUCT59    201402  22275.0  22275.0     2  2014.0
2      A60  PRODUCT34    201402   4463.0   4463.0     2  2014.0
3      A60  PRODUCT47    201402      0.0      0.0     2  2014.0
4      A60  PRODUCT56    201402     23.0     23.0     2  2014.0

### 함수로 만들어 버리기

In [41]:
def customFunction(inputColumn):
    yearValue = inputColumn/100
    yearValue = int(yearValue)
    return yearValue

In [42]:
selloutData["YEAR"] = selloutData["YEARWEEK"].apply(customFunction)
selloutData.head()

  REGIONID    PRODUCT  YEARWEEK      QTY  NEW_QTY  WEEK  YEAR
0      A60   PRODUCT4    201402     71.0     71.0     2  2014
1      A60  PRODUCT59    201402  22275.0  22275.0     2  2014
2      A60  PRODUCT34    201402   4463.0   4463.0     2  2014
3      A60  PRODUCT47    201402      0.0      0.0     2  2014
4      A60  PRODUCT56    201402     23.0     23.0     2  2014

In [43]:
sortKey = ["REGIONID","PRODUCT","YEARWEEK"]
sortData = refineData.sort_values(sortKey)
sortData.head()

     REGIONID    PRODUCT  YEARWEEK    QTY  NEW_QTY  WEEK    YEAR
298       A00  PRODUCT34    201401  661.0    661.0     1  2014.0
1757      A00  PRODUCT34    201402  679.0    679.0     2  2014.0
3125      A00  PRODUCT34    201403  578.0    578.0     3  2014.0
205       A00  PRODUCT34    201404  532.0    532.0     4  2014.0
4369      A00  PRODUCT34    201405  516.0    516.0     5  2014.0

### 인덱스 정리

In [44]:
step1Data = sortData.reset_index(drop = True)
##drop으로 인덱스숫자를 지우고 자연스럽게 만든다.
step1Data.head()

  REGIONID    PRODUCT  YEARWEEK    QTY  NEW_QTY  WEEK    YEAR
0      A00  PRODUCT34    201401  661.0    661.0     1  2014.0
1      A00  PRODUCT34    201402  679.0    679.0     2  2014.0
2      A00  PRODUCT34    201403  578.0    578.0     3  2014.0
3      A00  PRODUCT34    201404  532.0    532.0     4  2014.0
4      A00  PRODUCT34    201405  516.0    516.0     5  2014.0

### 04.11 시작

### 1.rolling 함수 다시 써보기

In [13]:
##롤링함수를 쓰기전에는 정렬은 기본이다!!!!(꼭 헤줘야함)
##정렬은 모든 단계의 기본적으로 하는 것!!!

### 기본 이동평균 함수

In [45]:
step1Data["MA"] = step1Data.NEW_QTY.rolling(window = 15, min_periods=1, center = True).mean()

In [46]:
step1Data.head()
##step1Data.to_csv('./result.csv') - 데이터 저장 index = False로 주면 인덱스가빠짐
step1Data.to_csv('./result.csv')

In [47]:
pwd

'C:\\Users\\SMART-24\\Python_FinTech\\03. Data using Pandas'

### 그룹 지정

In [48]:
filteredData = step1Data[(step1Data.REGIONID=="A00") &
                         (step1Data.PRODUCT == "PRODUCT34")]

In [49]:
groupKey = ["REGIONID","PRODUCT","YEAR"]

In [50]:
groupResult = step1Data.groupby(groupKey)[["NEW_QTY"]].mean().head()
groupResult.head()
g2 = groupResult.reset_index()

In [51]:
result = pd.read_csv('./result.csv')
result["YEAR"] = (result.YEARWEEK /100).astype(int)
result.head()
result.reset_index().head()

,index,Unnamed: 0,REGIONID,PRODUCT,YEARWEEK,QTY,NEW_QTY,WEEK,YEAR,MA
0,0,0,A00,PRODUCT34,201401,661.0,661.0,1,2014,520.000000
1,1,1,A00,PRODUCT34,201402,679.0,679.0,2,2014,514.444444
2,2,2,A00,PRODUCT34,201403,578.0,578.0,3,2014,516.800000
3,3,3,A00,PRODUCT34,201404,532.0,532.0,4,2014,503.363636
4,4,4,A00,PRODUCT34,201405,516.0,516.0,5,2014,490.750000

### 데이터 merge

In [52]:
mergeData = pd.merge(result,g2,left_on = groupKey, right_on= groupKey, how= "left")
mergeData.head()

,Unnamed: 0,REGIONID,PRODUCT,YEARWEEK,QTY,NEW_QTY_x,WEEK,YEAR,MA,NEW_QTY_y
0,0,A00,PRODUCT34,201401,661.0,661.0,1,2014,520.000000,282.12
1,1,A00,PRODUCT34,201402,679.0,679.0,2,2014,514.444444,282.12
2,2,A00,PRODUCT34,201403,578.0,578.0,3,2014,516.800000,282.12
3,3,A00,PRODUCT34,201404,532.0,532.0,4,2014,503.363636,282.12
4,4,A00,PRODUCT34,201405,516.0,516.0,5,2014,490.750000,282.12

In [53]:
mergeData2 = pd.merge(result,g2,how = "left",on=["REGIONID","PRODUCT"])
mergeData2.head()

,Unnamed: 0,REGIONID,PRODUCT,YEARWEEK,QTY,NEW_QTY_x,WEEK,YEAR_x,MA,YEAR_y,NEW_QTY_y
0,0,A00,PRODUCT34,201401,661.0,661.0,1,2014,520.000000,2014.0,282.120000
1,0,A00,PRODUCT34,201401,661.0,661.0,1,2014,520.000000,2015.0,81.882353
2,0,A00,PRODUCT34,201401,661.0,661.0,1,2014,520.000000,2016.0,44.905660
3,0,A00,PRODUCT34,201401,661.0,661.0,1,2014,520.000000,2017.0,47.500000
4,1,A00,PRODUCT34,201402,679.0,679.0,2,2014,514.444444,2014.0,282.120000

In [54]:
len(mergeData)

123864

In [55]:
len(mergeData2)

124332

### 그룹바이 함수만들기

In [56]:
groupKey = ["REGIONID","PRODUCT"]

In [59]:
groupDataSet = mergeData.groupby(groupKey)

In [62]:
oneGroup = groupDataSet.get_group(list(groupDataSet.groups)[0])
oneGroup.head()

,Unnamed: 0,REGIONID,PRODUCT,YEARWEEK,QTY,NEW_QTY_x,WEEK,YEAR,MA,NEW_QTY_y
0,0,A00,PRODUCT34,201401,661.0,661.0,1,2014,520.000000,282.12
1,1,A00,PRODUCT34,201402,679.0,679.0,2,2014,514.444444,282.12
2,2,A00,PRODUCT34,201403,578.0,578.0,3,2014,516.800000,282.12
3,3,A00,PRODUCT34,201404,532.0,532.0,4,2014,503.363636,282.12
4,4,A00,PRODUCT34,201405,516.0,516.0,5,2014,490.750000,282.12

In [63]:
def groupRolling(oneGroup):
    # len(list(groupDataSet.groups))
    # oneGroup = groupDataSet.get_group(list(groupDataSet.groups)[2])
    
    indexGroupData = oneGroup.reset_index(drop = True)
    indexGroupData["MA2"] = indexGroupData["NEW_QTY_x"].rolling(window=5, center = True).mean()
    
    return indexGroupData

In [64]:
finalResult = mergeData.groupby(groupKey).apply(groupRolling)

In [95]:
finalResult.head()

                      Unnamed: 0 REGIONID    PRODUCT  YEARWEEK    QTY  \
REGIONID PRODUCT
A00      PRODUCT34 0           0      A00  PRODUCT34    201401  661.0
                   1           1      A00  PRODUCT34    201402  679.0
                   2           2      A00  PRODUCT34    201403  578.0
                   3           3      A00  PRODUCT34    201404  532.0
                   4           4      A00  PRODUCT34    201405  516.0

                      NEW_QTY_x  WEEK  YEAR          MA  NEW_QTY_y    MA2
REGIONID PRODUCT
A00      PRODUCT34 0      661.0     1  2014  520.000000     282.12    NaN
                   1      679.0     2  2014  514.444444     282.12    NaN
                   2      578.0     3  2014  516.800000     282.12  593.2
                   3      532.0     4  2014  503.363636     282.12  545.6
                   4      516.0     5  2014  490.750000     282.12  491.2

### 4주차로만 계산해서 컬럼을 생성해라

### concat

In [96]:
fullData = pd.read_csv('../dataset/kopo_channel_seasonality_new.csv')

In [97]:
a01Data =fullData[fullData.REGIONID == "A01"]

In [99]:
len(a01Data)

3611

In [101]:
a20Data = fullData[fullData.REGIONID == "A20"]

In [102]:
len(a20Data)

471

In [103]:
resultConcat = pd.concat([a01Data,a20Data], axis=0)

In [104]:
len(resultConcat)

4082